In [6]:
# 7장 데이터 정제 및 준비
# 결측치
import pandas as pd
import numpy as np
string_data = pd.Series(['a','b',np.nan,'d'])
string_data.isnull() #null이 어디 있냐 True 값 자리에 있음.

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7]) # 2번째 4째에 누락이 되어있을 것임(자율주행을 예로 들면 오류가 생겨 데이터가 끊김->na값 출력)
data.dropna()                                 # na값 제거

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
from numpy import nan as NA
data = pd.DataFrame([ [1,6.5,3] , [1, NA, NA] , [NA,NA,NA] , [NA,6.5,3]]) # 데이터 프레임은 2차원임을 꼭 알아두자
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleanes_data = data.dropna()
cleanes_data                # 데이터가 남는게 없음

     0    1    2
0  1.0  6.5  3.0

In [21]:
cleanes_data2 = data.dropna(how="all") #둘다 모두 na인것만 제외
cleanes_data2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df2 = df. fillna(0) # 새로운 데이터 프레임을 만들고 원본은 유지
df2
df.fillna(0, inplace = True) # 원본 내용 교체

NameError: name 'df' is not defined

In [27]:
# 중복 제거하기(다양한 출처의 정보를 취합하는 과정에서 중복이 생김) 
dic_data = {"k1":['one','two','one','two','one','two','two'],
           "k2":[1,1,2,3,3,4,4]}
data = pd.DataFrame(dic_data)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated() # 5,6번 중복 발견

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
data.drop_duplicates() # 6번 항목이 날아감.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [39]:
data['v1'] = [0,1,2,3,4,5,6] # v1 을 추가하면서 데이터가 다르면서 이전에 k1,2의 중복값이라고 인식을 못함.
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data['v1'] = [0,1,2,3,4,5,6]
data.drop_duplicates(['k1']) # k1 을 기준으로 중복 체크를 해볼게

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1','k2'], keep="last") # 마지막으로 발견된 값으로 반환한다 --> 5번 항목이 아닌 6번 항목을 선택함

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [44]:
# 양자화(구간)
ages = [ 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] # 나이
bins = [18, 25, 35, 60, 100] # 구간

In [46]:
cats = pd.cut(ages, bins)
cats # 총 길이 12, 카테고리 4개

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
pd.value_counts(cats) # 구간별 갯수 제시

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [50]:
# 정규 표현식
import re
text = "foo bar\t baz \tqux"
print(text)

foo bar	 baz 	qux

In [52]:
re.split('\s+', text) # 띄어쓰기를 통일감있게 정리하고 구분함.

['foo', 'bar', 'baz', 'qux']

In [53]:
text = """Dave dave@google.com
Steve steve@google.com
Rob rob@goole.com
Ryan ryan@google.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+.[A-Z]{2,4}' # 이메일 앞 'A-Z0-9._%+-' 과 같은 넣을 수 있는 것들을 나열 / @ 뒤에 들어갈'A-Z0-9.-' 나열
                                                   # . 뒤에는 알파벳가 2~4글자가 들어갈 것임을 알려줌 
re1 = re.compile(pattern, flags=re.IGNORECASE)     # .IGNORECASE 대소문자 구분 X

In [55]:
re1.findall(text) # 위 규칙에 맞춰 데이터를 찾아줘

['dave@google.com', 'steve@google.com', 'rob@goole.com', 'ryan@google.com']

In [59]:
# 8장 데이터 준비하기
# 계층적 색인
data = pd.Series(np.random.randn(9),
                index=['a','a','a','b','b','c','c','d','d'])
data

a   -1.131864
a    1.638844
a   -1.475255
b    0.079233
b    0.916839
c   -0.114167
c   -1.537106
d   -0.366897
d    0.226328
dtype: float64

In [61]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                       [1,2,3, 1, 2, 1, 2, 1, 2]]) #a1 a2 a3 b1 b2 ...
data

a  1    0.222999
   2    0.833202
   3   -0.379599
b  1    0.441013
   2    0.365198
c  1    0.310312
   2   -2.492815
d  1   -0.099865
   2   -0.097169
dtype: float64

In [63]:
data["b"] # b1 b2

1    0.441013
2    0.365198
dtype: float64

In [65]:
data.loc[['b','d']] # 레벨 1을 추출 하려면 괄호 2개

b  1    0.441013
   2    0.365198
d  1   -0.099865
   2   -0.097169
dtype: float64

In [67]:
data.loc['b',2] # b2 레벨 1,2를 동시에 써서 추출하려면 괄호 1개 주의!

0.3651984369335112

In [73]:
# 데이터 합치기
df1 = pd.DataFrame({'key' : ['b','b','a','c','a','a','b'], 'data1': [0, 1, 2, 3, 4, 5, 6]}) 
df2 = pd.DataFrame({'key' : ['a', 'b', 'd'], 'data2': [0, 1, 2]})

In [74]:
pd.merge(df1, df2) # 교집합 부분만 출력되는 '내부조인'이 수행됨.

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
pd.merge(df1, df2, on="key") # 같은 결과 값을 출력하지만 명시적으로 지정해주는 습관을 들이는게 좋다 
                             # key를 기준으로 묶겠다.

In [75]:
# 키가 다르다면 합병은 어떻게 될까
df1 = pd.DataFrame({'lkey' : ['b','b','a','c','a','a','b'], 'data1': [0, 1, 2, 3, 4, 5, 6]}) 
df2 = pd.DataFrame({'ikey' : ['a', 'b', 'd'], 'data2': [0, 1, 2]})

In [77]:
pd.merge(df1, df2, left_on="lkey",
        right_on ="ikey")

  lkey  data1 ikey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [79]:
# 축 따라 이어붙이기 concatenate
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [81]:
np.concatenate([arr,arr]) # 합병할게용 열방향으로

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [83]:
np.concatenate([arr,arr], axis =1) # 행방향으로 합병

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [85]:
s1 = pd.Series([0,1], index = ['a','b'])
s2 = pd.Series([2,3,4], index = ['c','d','e'])
s3 = pd.Series([5,6], index = ['f','g'])
print(s1);print(s2);print(s3);

a    0
b    1
dtype: int64
c    2
d    3
e    4
dtype: int64
f    5
g    6
dtype: int64

In [87]:
pd.concat([s1,s2,s3]) # 열방향으로 쭈욱 묶여나감.

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [89]:
pd.concat([s1,s2,s3] , axis = 1) # merge(합칠건 합치고 나열할건 나열하고)가 아닌 concat(무조건 갖다 붙이기)로 
                                 # 행 방향으로 묶다보니 이러한 결과를 만들어냄. / DB에서 merge를 많이 하게 될거임 -> pd에서는 concat을 많이사용

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [91]:
df1 = pd.DataFrame(np.random.randn(3,4), columns= ['a','b','c','d'])
df2 = pd.DataFrame(np.random.randn(2,3), columns= ['b','d','a'])
df1

          a         b         c         d
0  0.424224 -1.538728 -0.490800  0.673758
1  0.069505 -0.318681  0.366006  0.368819
2  0.154849  0.496663 -0.390361 -0.057646

In [93]:
pd.concat([df1, df2]) # 인덱스가 기계적으로 붙음

          a         b         c         d
0  0.424224 -1.538728 -0.490800  0.673758
1  0.069505 -0.318681  0.366006  0.368819
2  0.154849  0.496663 -0.390361 -0.057646
0  1.889037 -0.182070       NaN -1.505468
1 -1.140673  0.829582       NaN -0.169732

In [97]:
pd.concat([df1, df2], ignore_index=True) # 기존의 인덱스를 무시하고 새로운 넘버링

          a         b         c         d
0  0.424224 -1.538728 -0.490800  0.673758
1  0.069505 -0.318681  0.366006  0.368819
2  0.154849  0.496663 -0.390361 -0.057646
3  1.889037 -0.182070       NaN -1.505468
4 -1.140673  0.829582       NaN -0.169732

In [98]:
# 리샘플링과 빈도 변환 P462

In [102]:
rng = pd.date_range('2000-01-01', periods=12, freq="T")
rng

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 00:01:00',
               '2000-01-01 00:02:00', '2000-01-01 00:03:00',
               '2000-01-01 00:04:00', '2000-01-01 00:05:00',
               '2000-01-01 00:06:00', '2000-01-01 00:07:00',
               '2000-01-01 00:08:00', '2000-01-01 00:09:00',
               '2000-01-01 00:10:00', '2000-01-01 00:11:00'],
              dtype='datetime64[ns]', freq='T')

In [105]:
ts = pd.Series(np.arange(12), index=rng)
ts

2000-01-01 00:00:00     0
2000-01-01 00:01:00     1
2000-01-01 00:02:00     2
2000-01-01 00:03:00     3
2000-01-01 00:04:00     4
2000-01-01 00:05:00     5
2000-01-01 00:06:00     6
2000-01-01 00:07:00     7
2000-01-01 00:08:00     8
2000-01-01 00:09:00     9
2000-01-01 00:10:00    10
2000-01-01 00:11:00    11
Freq: T, dtype: int32

In [108]:
ts.resample('5min', closed="right").sum() # sum 방식으로 5분 단위 데이터로 만듦 누적량

1999-12-31 23:55:00     0
2000-01-01 00:00:00    15
2000-01-01 00:05:00    40
2000-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [109]:
ts.resample('5min', closed="right").mean() # 현재 상태 모니터링 하나 하나의 값

1999-12-31 23:55:00     0
2000-01-01 00:00:00     3
2000-01-01 00:05:00     8
2000-01-01 00:10:00    11
Freq: 5T, dtype: int32